Repository: alexandruspataru/bizoo-wp
Catalog: languages/nexus-*.po
Languages: ro_ro

# Admin page title
source: Bizoo Data Feed Tool
ro_ro: Utilitar Feed Bizoo

# Admin page content
source: Bizoo Feed Settings
ro_ro: Setari Feed Bizoo

# Admin page content
source: Please select the post type you would like to include in the Data Feed.
ro_ro: Va rog sa selectati tipul posturilor care vor fi incluse in Feed.

# Admin page content
source: Optional - How many posts to include? Leave blank to include them all.
ro_ro: Optional - Cate postari sa includem? Lasa gol pentru a le include pe toate.

# Admin page content
source: Optional - Order type
ro_ro: Optional - Tipul ordonarii

# Admin page content
source: Optional - Order criteria
ro_ro: Optional - Criteriu de ordonare

# Admin page content
source: Please choose something
ro_ro: Va rog alegeti ceva

# Admin page content
source: Ascending
ro_ro: Ascendent

# Admin page content
source: Descending
ro_ro: Descrescator

# Admin page content
source: None
ro_ro: Niciuna

# Admin page content
source: Random
ro_ro: Aleator

# Admin page content
source: Date inserted
ro_ro: Data publicarii

# Admin page content
source: Date modified
ro_ro: Data ultimei modificari

# Admin page content
source: Title
ro_ro: Titlu

# Admin page content
source: Parent ID
ro_ro: ID Parinte

# Admin page content
source: Comment Count
ro_ro: Numarul de comentarii

# Admin page content
source: The feed location is:
ro_ro: Locatia feed-ului este:

source: Data Feed plugin for Bizoo.ro
ro_ro: Modul pentru Feed Bizoo.ro

source: The plugin helps you syncronize your products (or any custom post type) with Bizoo platform
ro_ro: Modulul va ajuta sa sincronizati produsele (sau orice tip de postare custom) cu platforma Bizoo
